In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
                    {"a" : [None, 5, 6],
                     "b" : [7, 8, 9],
                     "c" : [10, 11, 12]},
                     index = [1, 2, 3])

### Drop rows with any column having NA/null data.

In [3]:
df.dropna()

     a  b   c
2  5.0  8  11
3  6.0  9  12

In [4]:
df

     a  b   c
1  NaN  7  10
2  5.0  8  11
3  6.0  9  12

### Replace all NA/null data with value.

In [5]:
df = df.fillna(4)

In [6]:
df

     a  b   c
1  4.0  7  10
2  5.0  8  11
3  6.0  9  12